{
    "action_open_file": "Select a single file containing one or more images (.png, .npy, ...).",
    "action_open_folder": "Select a folder containing multiple (single-image) files.",
    "action_load_tof": "Load a tof .json file that is recorded additionally to the data.",
    "action_export": "Export the currently displayed images to the selected folder.",
    "action_restart": "Manually restart the application.",

    "button_autofit": "Automatically fits the range of the colormap to the colors in the image.",
    "checkbox_auto_colormap": "If set, switches to a centered diverging colormap if negative values in the image appear (e.g. through normalization).",
    "button_load_lut": "Loads a LUT from a .json file.",
    "button_export_lut": "Saves the current LUT to a .json file. If an .blitz project file is selected, this LUT gets loaded automatically the next time the application is opened.",

    "button_open_file": "Select a single file containing one or more images (.png, .npy, ...).",
    "button_open_folder": "Select a folder containing multiple (single-image) files.",
    "checkbox_load_8bit": "Load each image as 8bit.",
    "checkbox_load_grayscale": "Assume each image is grayscale.",
    "spinbox_load_size": "Adjust the relative size of each image.",
    "spinbox_load_subset": "Adjust the relative number of images loaded.",
    "spinbox_max_ram": "Set an upper bound for memory used by the application.",
    "checkbox_video_dialog_always": "When checked: dialog opens for every load (video/image/folder). Otherwise: only when first load or above threshold.",
    "spinbox_video_dialog_mb": "When 'Always show' is off: loads below this estimated size use session defaults. Above this size, the options dialog opens.",
    "checkbox_sync_file": "When loading data, also loads the corresponding .blitz project file if it exists.\nAlso saves .blitz project files automatically when loading new data.\nThe file is created in the same folder as the dataset with the same name.",

    "button_connect": "Connect to the given server address. Keeps listening until manually disconnected.",
    "button_disconnect": "Disconnect from the server.",

    "checkbox_mask": "Shows a rectangular selection area. Resize and apply for masking all images.",
    "button_reset_mask": "Resets the mask and shows the original image.",
    "button_image_mask": "Select a binary image of the same size as the current data to mask all pixels where that image has value 1.",

    "spinbox_width_h": "Changes the area of the horizontal line. The upper plot shows the mean over all vertical pixels at one position.",
    "spinbox_width_v": "Changes the area of the vertical line. The left plot shows the mean over all horizontal pixels at one position.",

    "checkbox_roi": "Turn on the ROI that shows the mean of all pixels in its range over time.",
    "combobox_roi": "Choose a format for the ROI.",
    "checkbox_roi_drop": "Whether to update the ROI plot (lower window) upon dragging the ROI or only on drop (releasing the mouse button).",

    "button_crop": "Crop the image dataset to the above selected time interval.",
    "button_crop_undo": "Reloads the last saved dataset. If uncropped data was not saved in RAM, instead loads it from the last loaded path again.",
    "checkbox_crop_keep": "If checked, crop is reversible: full data stays in RAM, Undo restores all.",
    "checkbox_crop_show_range": "Show a blue box in the timeline to select a time interval.",
    "spinbox_current_frame": "Current frame index. Direct input to jump to a frame.",
    "spinbox_crop_range_start": "Index of the first image in the cropped dataset.",
    "spinbox_crop_range_end": "Index of the last image in the cropped dataset.",
    "checkbox_window_const": "Keep window length fixed when changing Start or End. Useful for scanning a fixed window along the timeline.",

    "checkbox_minmax_per_image": "Envelope: at each x (horizontal) or y (vertical), min and max over ALL values in the orthogonal direction.",
    "checkbox_envelope_per_crosshair": "Envelope for current frame: min/max per position across crosshair thickness.",
    "checkbox_envelope_per_dataset": "Envelope per position over all frames (uses same crosshair band as mean and per-frame envelope).",
    "spinbox_envelope_pct": "Envelope mode: 0 = Min/Max (hard), 1-49 = percentile (e.g. 5 gives 5th and 95th percentile). Applies to all three envelope types.",

    "label_reduce": "Temporal Dimensionality Reduction: Create summary images by aggregating pixel values (e.g. mean) across a time series of images.",
    "combobox_reduce": "Calculate a metric on the time axis, e.g. mean of all images loaded. This visualizes a single image.",

    "checkbox_norm_range": "Select this to perform a normalization over the given time interval / image indices.\nSubtracts or divides each image by the mean of all images in the interval.",
    "checkbox_norm_show_range": "Show a blue box in the timeline to select a time interval.",

    "checkbox_norm_bg": "Select this to subtract or divide each image by a given background image.",
    "button_bg_input": "Select an image that is of same size as the currently loaded data.",
    "button_bg_divide": "Select an image that is of same size as the currently loaded data.",

    "checkbox_norm_lag": "Select this to subtract the mean of the next [lag] to [lag+window] images from the current time step. Might reduce the number of images shown.",
    "spinbox_norm_window": "The number of images to calculate the mean over.",
    "spinbox_norm_lag": "The number of images to skip before computing the sliding mean and subtracting this from the current time step.",
    "spinbox_norm_factor": "Intensity scaling (factor) applied to references. 100 = full strength.",
    "spinbox_norm_blur": "Blurs the reference using a Gaussian kernel of the given size.",
    "checkbox_norm_apply": "Master switch: apply the normalization pipeline.",
    "checkbox_subtract_range": "Step 1: Subtract the range mean (or chosen metric) from each image.",
    "checkbox_subtract_file": "Step 1: Subtract the loaded background image.",
    "checkbox_subtract_sliding": "Step 1: Subtract a sliding-window mean from each frame.",
    "checkbox_divide_range": "Step 2: Divide each image by the range mean (or chosen metric).",
    "checkbox_divide_file": "Step 2: Divide each image by the loaded background image.",
    "checkbox_divide_sliding": "Step 2: Divide each image by a sliding-window mean.",
    "combobox_norm": "Metric to use for the range reference (MEAN, MAX, MIN, STD).",
    "checkbox_agg_range": "When checked, aggregation uses only frames in the specified range (non-destructive).",
    "spinbox_agg_range_start": "First frame index for aggregation range.",
    "spinbox_agg_range_end": "Last frame index for aggregation range.",

    "checkbox_mm": "Convert all lengths into an arbitrary unit (au) instead of pixels based on a known scale.",
    "textbox_area": "Shows the area in the polygon.",
    "textbox_circ": "Shows the circumference of the polygon.",
    "textbox_bounding_rect": "Shows width and height of the bounding rectangle enclosing the measure tool.",
    "checkbox_show_bounding_rect": "Shows the bounding rectangle of the measure tool inside the plot.",

    "checkbox_rosee_local_extrema": "Use local instead of global extrema to calculate event interval.",
    "spinbox_rosee_smoothing": "Smoothen the fluctuation curve (red) before calculating indices",
    "checkbox_rosee_normalize": "Normalize values of all curves to the interval [0, 1].",
    "checkbox_rosee_active": "Enable RoSEE and configure available options below.",
    "checkbox_rosee_h": "Calculate and show RoSEE's cumulative sum, fluctuation curve and event indices of the horizontal line.",
    "checkbox_rosee_v": "Calculate and show RoSEE's cumulative sum, fluctuation curve and event indices of the vertical line.",
    "textbox_rosee_interval_h": "Event interval of the horizontal line. Start and end are marked by green circles.",
    "textbox_rosee_interval_v": "Event interval of the vertical line. Start and end are marked by purple circles.",
    "textbox_rosee_slope_h": "Index of maximal signal value of the horizontal line. This is marked by a dark green rectangle.",
    "textbox_rosee_slope_v": "Index of maximal signal value of the vertical line. This is marked by a dark purple rectangle.",
    "checkbox_rosee_show_indices": "Show event indices and point of largest value of the signal in the plot.",
    "checkbox_rosee_show_lines": "Extend the event indices as lines in the image.",
    "checkbox_rosee_in_image_h": "Show all event boundaries in the image marked with green dots for horizontal orientation.",
    "checkbox_rosee_in_image_v": "Show all event boundaries in the image marked with purple dots for vertical orientation.",

    "checkbox_show_isocurve": "Show isocurves in the image and corresponding draggable levels in the color table.",
    "spinbox_isocurves": "Change the number of displayed isocurves. Their level will be equally distributed in [mean-std, mean+std].",
    "spinbox_iso_smoothing": "Smoothen the isocurves by applying an Gaussian filter with given width to the current image."
}