{
    "action_open_file": "Select a single file containing one or more images (.png, .npy, ...).",
    "action_open_folder": "Select a folder containing multiple (single-image) files.",
    "action_load_tof": "Load a tof .json file that is recorded additionally to the data.",
    "action_export": "Export the currently displayed images to the selected folder.",
    "action_project_save": "Writes an .ini project file with all current configurations.",
    "action_project_open": "Select an .ini project file.",
    "action_restart": "Manually restart the application.",

    "checkbox_autofit": "If checked, automatically adjusts the color lookup table to the displayed colors in the image. If negative values appear, this also switches to another gradient preset, which is useful for normalization.",
    "button_load_lut": "Loads a LUT from a .json file.",
    "button_export_lut": "Saves the current LUT to a .json file. If an .ini file is selected, this LUT gets loaded automatically the next time the application is opened.",

    "button_open_file": "Select a single file containing one or more images (.png, .npy, ...).",
    "button_open_folder": "Select a folder containing multiple (single-image) files.",
    "checkbox_load_8bit": "Load each image as 8bit.",
    "checkbox_load_grayscale": "Assume each image is grayscale.",
    "spinbox_load_size": "Adjust the relative size of each image.",
    "spinbox_load_subset": "Adjust the relative number of images loaded.",
    "spinbox_max_ram": "Set an upper bound for memory used by the application.",

    "button_connect": "Connect to the given server address. Keeps listening until manually disconnected.",
    "button_disconnect": "Disconnect from the server.",

    "checkbox_mask": "Shows a rectangular selection area. Resize and apply for masking all images.",
    "button_reset_mask": "Resets the mask and shows the original image.",
    "button_image_mask": "Select a binary image of the same size as the current data to mask all pixels where that image has value 1.",

    "spinbox_width_h": "Changes the area of the horizontal line. The upper plot shows the mean over all vertical pixels at one position.",
    "spinbox_width_v": "Changes the area of the vertical line. The left plot shows the mean over all horizontal pixels at one position.",

    "checkbox_roi": "Turn on the ROI that shows the mean of all pixels in its range over time.",
    "combobox_roi": "Choose a format for the ROI.",
    "checkbox_roi_drop": "Whether to update the ROI plot (lower window) upon dragging the ROI or only on drop (releasing the mouse button).",

    "button_crop": "Crop the image dataset to the above selected time interval.",
    "button_crop_undo": "Reloads the last saved dataset. If uncropped data was not saved in RAM, instead loads it from the last loaded path again.",
    "checkbox_crop_keep": "If selected, keeps the full dataset in RAM. Can be retrieved by 'undo'.",
    "checkbox_crop_show_range": "Show a blue box in the timeline to select a time interval.",

    "label_reduce": "Temporal Dimensionality Reduction: Create summary images by aggregating pixel values (e.g. mean) across a time series of images.",
    "combobox_reduce": "Calculate a metric on the time axis, e.g. mean of all images loaded. This visualizes a single image.",

    "checkbox_norm_range": "Select this to perform a normalization over the given time interval / image indices. Subtracts or divides each image by the mean of all images in the interval.",
    "checkbox_norm_show_range": "Show a blue box in the timeline to select a time interval.",

    "checkbox_norm_bg": "Select this to subtract or divide each image by a given background image.",
    "button_bg_input": "Select an image that is of same size as the currently loaded data.",

    "checkbox_norm_lag": "Select this to subtract the mean of the next [lag] to [lag+window] images from the current time step. Might reduce the number of images shown.",
    "spinbox_norm_window": "The number of images to calculate the mean over.",

    "spinbox_norm_lag": "The number of images to skip before computing the sliding mean and subtracting this from the current time step.",
    "spinbox_norm_beta": "Percentage of the image that is subtracted or divided.",
    "checkbox_norm_subtract": "Subtract the selected image from all images.",
    "checkbox_norm_divide": "Divide all images by the selected image. Make sure that no division-by-zero occurs.",

    "checkbox_mm": "Convert all lengths into an arbitrary unit (au) instead of pixels based on a known scale."
}